onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Действия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Действия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныСообщений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_омни_ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбозначениеВАлгоритме</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Действия/Ext/ManagerModule.bsl
Функция ВыполнитьДействие(Действие, ТекстСообщения, Контакт, Бот, Параметры = Неопределено) Экспорт
	
	Результат = Новый Структура("Ошибка, Описание", Ложь, "");
	
	Параметры = Новый Структура;
	Шаблоны = Новый Структура;

    КомандаПобитая = СтрРазделить(ТекстСообщения, " ");
	ИмяКоманды = КомандаПобитая[0];
	КомандаПобитая.Удалить(0);
	
	Если Параметры = Неопределено Тогда 
		Параметры = КомандаПобитая;	
	КонецЕсли;
	
	Инд = 0;                                  
	РеквизитыДействия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Действие, "Параметры, ШаблоныСообщений, Алгоритм");
	ПараметрыВыборка = РеквизитыДействия.Параметры.Выбрать();                                
	ШаблоныВыборка = РеквизитыДействия.ШаблоныСообщений.Выбрать();
	
	Если ПараметрыВыборка.Количество() > КомандаПобитая.Количество() Тогда
		
		Результат.Ошибка = Истина;                                            
		ШаблонОшибки = НСтр("ru='Недостаточно фактических параметров, ожидается: %1'", );
		ТекстПараметры = СтрокаСЧислом("%1 параметров;%1 параметр;;%1 параметра;%1 параметров;%1 параметра",
							ПараметрыВыборка.Количество(),
							ВидЧисловогоЗначения.Количественное,
							"Л=ru; ЧН=0");
		Результат.Описание = СтрШаблон(ШаблонОшибки, ТекстПараметры);
		
		Возврат Результат;
		
	КонецЕсли;
	
	Пока ПараметрыВыборка.Следующий() Цикл                                   
		Параметры.Вставить(ПараметрыВыборка.ИмяПараметра, КомандаПобитая[Инд]);
		Инд = Инд + 1;
	КонецЦикла; 
	                           
	Пока ШаблоныВыборка.Следующий() Цикл                                   
		Шаблоны.Вставить(ШаблоныВыборка.ОбозначениеВАлгоритме, Параметры.Шаблон);
	КонецЦикла;
	
	Возврат ПроизвестиВыполнениеАлгоритмаИзолировано(РеквизитыДействия.Алгоритм, Параметры, Шаблоны, ИмяКоманды, Контакт, Бот);
	
КонецФункции

Функция ПроизвестиВыполнениеАлгоритмаИзолировано(Алгоритм, Параметры, Шаблоны, Знач ИмяКоманды, Знач Контакт, Знач Бот)
	
	Попытка
		Выполнить(Алгоритм);
	Исключение
		Возврат Новый Структура("Ошибка, Описание", Истина, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
	Возврат Новый Структура("Ошибка, Описание", Ложь, "");
	
КонецФункции
